Repository: mozilla-l10n/mt-training-data
Catalog: zu/zu_pontoon.tmx
Source language: en_us
Languages: zu

source: You logged in as a different user, you must start the payment again.
zu: Ungene njengomsebenzisi owehlukile, kufanele uqale ukukhokha futhi.

source: Your PIN was locked
zu: I-PIN yakho ikhiyiwe

source: Your PIN was locked because you entered it incorrectly too many times. You can continue and try entering your PIN again or reset your PIN.
zu: I-PIN ikhiyiwe ngoba ufake engesiyo izikhathi eziningi kakhulu. Ungaqhubeka ngokuthi ufake i-PIN yakho futhi noma uyisethe kabusha i-PIN yakho.

source: Your purchase is complete. Close the window to continue
zu: Usuqedile ukuthenga. Vala ikhasi ukuze uqhubeke

source: You will not be charged.
zu: Ngeke ukhokhiswe.

source: {0} and {1} other replied
zu: {0} nomunye o{1} baphendulile

source: {0} answer
zu: {0} impendulo

source: {0} documents
zu: {0} amadokhumenti

source: {0} question
zu: {0} imibuzo

source: {0} replied
zu: {0} uphendulile

source: {0} solution
zu: {0} isisombululo

source: 1 article can be viewed by 400 million users and translated into 70+ languages
zu: i-athikhili e-1 ingabukwa ngabasebenzisi abayizigidi ezingama-400 ahumushelwe ezilimini azingama-70+

source: 1m
zu: 1umzuzu

source: 1 new this week
zu: aba-{n} abasha kuleli sonto

source: 1 person has this problem
zu: Abantu aba-{n} bana le nkinga

source: 1 post
zu: amaphosti {0}

source: 1 reply
zu: impendulo e-1

source: 1 tweet can save 1 day
zu: i-tweet e-1 ingasiza ukuhlenga usuku olu -1

source: 1y
zu: 1unyaka

source: 2008 L10n Badge
zu: I-2008 L10n Badge

source: 2009 L10n Badge
zu: I-2009 L10n Badge

source: 2010 Army of Awesome Badge
zu: I-2010 Army of Awesome Badge

source: 2010 KB Badge
zu: I-2010 KB Badge

source: 2010 L10n Badge
zu: I-2010 L10n Badge

source: 2010 Support Forum Badge
zu: Ibheji Lesithangami Sokweseka 2010

source: 2011 Army of Awesome Badge
zu: I-2011 Army of Awesome Badge

source: 2011 KB Badge
zu: I-2011 KB Badge

source: 2011 L10n Badge
zu: I-2011 L10n Badge

source: 2011 Support Forum Badge
zu: Ibheji Lesithangami Sokweseka 2011

source: 2012 Army of Awesome Badge
zu: I-2012 Army of Awesome Badge

source: 2012 KB Badge
zu: I-2012 KB Badge

source: 2012 L10n Badge
zu: I-2012 L10n Badge

source: 2012 Support Forum Badge
zu: Ibheji Lesithangami Sokweseka 2012

source: 2013 Army of Awesome Badge
zu: I-2013 Army of Awesome Badge

source: 2013 KB Badge
zu: I-2013 KB Badge

source: 2013 L10n Badge
zu: I-2013 L10n Badge

source: 2013 Support Forum Badge
zu: Ibheji Lesithangami Sokweseka 2013

source: 2014 Army of Awesome Badge
zu: I-2014 Army of Awesome Badge

source: 2014 KB Badge
zu: I-2014 KB Badge

source: 2014 L10n Badge
zu: I-2014 L10n Badge

source: 2014 Support Forum Badge
zu: Ibheji Lesithangami Sokweseka 2014

source: 2015 Army of Awesome Badge
zu: Ama-Army of Awesome Badge ezi-2015

source: 2015 KB Badge
zu: I-2015 KB Badge

source: 2015 L10n Badge
zu: I-2015 L10n Badge

source: 2015 Support Forum Badge
zu: Ibheji Lesithangami Sokweseka 2015

source: 3m
zu: 3imizuzu

source: 6m
zu: 6imizuzu

source: About Us
zu: Mayelana Nathi

source: About {user}
zu: Mayelana {user}

source: Abusive content
zu: Umbhalo ohlukumezayo

source: Accept
zu: Amukela

source: Accepted and Fixed
zu: Kwemukelwe Kwalungiswa

source: Accepted formats include: PNG, JPEG, GIF. <a target="_blank" href="{learn_more}">Learn more...</a>
zu: Amafomethi amukelwayo abandakanya: PNG, JPEG, GIF. <a target="_blank" href="{learn_more}">Funda kabanzi...</a>

source: Accept this Revision
zu: Yamukela Lesi Sibukezo

source: Accept this Translation
zu: Yamukela Lesi Sihumusho

source: Access and organize your favorite webpages easily with bookmarks and tabs
zu: Finyelela bese uhlela kahle amakhasi ewebhu ayintandokazi yakho ngamabhukumaka namathebhu

source: Access denied
zu: Ukungena kunqatshiwe

source: Access websites easily with bookmarks and tab features
zu: Ngena kuzizindalwazi kalula ngama-bookmark kanye namafisha amathebhu

source: Account
zu: I-akhawunti

source: Account Administration
zu: Ukuphathwa Kwe-akhawunti

source: Account already activated
zu: I-akhawunti yakho seyaqaliswa ukusebenza

source: Account banned successfully!
zu: I-akhawunti ivinjiwe ngempumelelo!

source: Account is now being ignored!
zu: I-akhawunti manje seyizitshiwe!

source: Account Issues
zu: Izinkinga ze-akhawunti

source: Account successfully verified!
zu: I-akhawunti iqinisekiswe ngempumelelo!

source: A confirmation email will be sent to this address in order to post your question.
zu: I-imeyli yokuqinisekisa izothunyelelwa kuleli kheli ukuze uposele kuyo umbuzo wakho.

source: activation key
zu: inkinobho yokuqalisa ukusebenza

source: Active Contributors
zu: Abalekeleli Abasebenzayo

source: Add
zu: Faka

source: Add and configure your email accounts on Thunderbird
zu: Faka bese ulungisa ama-akhawunti e-imeyli yakho ku-Thunderbird

source: Add announcement
zu: Faka isaziso

source: Add Contributor
zu: Faka Onegalelo

source: Add Editor
zu: Faka Umhleli

source: Add group profile
zu: Faka iphrofayela yeqembu

source: Add images:
zu: Faka imifanekiso:

source: Additional System Details
zu: Eminye Imininingwane Yohlelo

source: Add Leader
zu: Faka Umholi

source: Add Member
zu: Faka ilungu

source: Add Reviewer
zu: Faka Umbukezi

source: Administration
zu: Ukuphathwa

source: Administrator
zu: Umlawuli

source: A document with this slug already exists in this locale.
zu: Idokhumenti enale slug isikhona kulesi sizinda.

source: A document with this title already exists in this locale.
zu: Idokhumenti enalesi sihloko isikhona vele kule ndawo.

source: Advanced Search
zu: Ukucinga Okuseqophelweni eliphakeme

source: Advanced Search Results
zu: Imiphumela Yokucinga Kweqophelo Eliphezulu

source: A few times a week
zu: Izikhathi ezimbalwa ngesonto

source: Affects search results
zu: Ithikameza imiphumela yokucinga

source: After
zu: Emva

source: A fully translated user interface improves the experience for site visitors in your language. Help <a href="%(url)s">translate the interface</a>.
zu: I-interface ehunyushwe ngokuphelele yomsebenzisi ithuthukisa amava ezivakashi kusayithi ngolimi lwakho. Usizo <a href="%(url)s">humusha i-interface</a>.

source: Aggregated Localization Metrics
zu: Amamethriksi Aqokelelwe Asendaweni

source: Aggregated Metrics
zu: Amamethriksi aqoqiwe

source: <a href="{reply_url}">last reply</a> by <a href="{user_url}">{username}</a> {when}
zu: <a href="{reply_url}">kugcine ukuphendulwa</a> ngu <a href="{user_url}">{username}</a> {when}

source: <a href="%(thread_url)s">%(thread_title)s</a><br> in <a href="%(document_discussion_url)s">%(document)s</a>
zu: <a href="%(thread_url)s">%(thread_title)s</a><br> ku<a href="%(document_discussion_url)s">%(document)s</a>

source: <a href="%(url)s">Forum Contributor</a> - Answer user support questions that are most-requested but have no replies.
zu: <a href="%(url)s">Isithangami Sabanegalelo</a> - Phendula imibuzo yokweseka abasebenzisi ebuzwa njalo kodwa engatholi zimpendulo.

source: <a href="%(url)s">KB Editor</a> - Help to update knowledge base articles that need changes or write new articles.
zu: <a href="%(url)s">KB Editor</a> - Siza ukuvuselela ama-athikhili ayisisekelo solwazi adinga izinguquko noma ukubhala ama-athikhili amasha.

source: <a href="%(url)s">L10N Contributor</a> - Help to translate Firefox Help content to your language.
zu: <a href="%(url)s">I-L10N Contributor</a> - Siza ukuhumusha i-Firefox Siza ukuguqula okubhaliwe kuye olimini lwakho.

source: <a href="%(url)s">Twitter Contributor</a> - Respond to tweets about Firefox.
zu: <a href="%(url)s">Onegalelo ku-Twitter </a> - Phendula ama-tweet amayelana ne-Firefox.

source: algorithm
zu: i-algorithm

source: All
zu: Konke

source: All Administration articles...
zu: Wonke ama-athikhili okuphatha...

source: All Articles
zu: Wonke Ama-athikhili

source: All articles requiring review...
zu: Wonke ama-athikhili adinga ukubukezwa...

source: All articles that require changes...
zu: Wonke ama-athikhili adinga izinguquko...

source: All articles with changes not ready for localization...
zu: Wonke ama-athikhili anezinguquko akakalungeli ukwenziwa njengawasendaweni...

source: All available SUMO badges
zu: Wonke amabheji e-SUMO atholakalayo

source: All canned responses articles...
zu: Wonke ama-athikhili ezipmendulo ezisethiwe...

source: All How To Contribute articles...
zu: Zonke izindlela Zokuba Negalelo kuma-athikhili...

source: All knowledge base articles...
zu: Wonke ama-athikhili asekelwe olwazini...

source: All Knowledge Base Articles
zu: Wonke Ama-athikhili Olwazi Oluyisisekelo

source: All locales
zu: Zonke izizinda

source: Allow discussion on this article?
zu: Uzovumela izingxoxo kule athikhili?

source: Allow translations:
zu: Ivumela ukuhumusha:

source: All posts
zu: Wonke amaphosti

source: All products
zu: Yonke imikhiqizo

source: All Products
zu: Yonke imikhiqizo

source: All questions
zu: Yonke imibuzo

source: All templates...
zu: Wonke amathempulethi...

source: All Time
zu: Sonke isikhathi

source: All Topics
zu: Zonke izihloko

source: All translations...
zu: Konke ukuhumusha...

source: All translations of this document will also be deleted.
zu: Bonke abahumushi bale dokhumenti nabo bazodilithwa.

source: All unhelpful articles...
zu: Wonke ama-athikhili angenasizo...

source: Almost there! We just need you to create a support forum account!
zu: Usuzoqeda! Sidinga nje ukuba wakhe i-imeyli yesithangami sokweseka!

source: Already have an account? Sign in
zu: Usunayo i-akhawunti vele? Sayinela ukungena

source: An email has been sent to the address below:
zu: I-imeyli ithunyelwe ekhelini elingezansi:

source: An error occured.
zu: Kube nephutha elenzekile.

source: An error occured: {message}
zu: Kunephutha elenzekile: {message}

source: An Error Occurred
zu: Kube Nephutha Elenzekile

source: A newer revision has already been reviewed.
zu: Ukubuyekeza okusha kwakamuva sekubukeziwe.

source: A newer version has already been reviewed.
zu: Ukubuyekeza okusha kwakamuva sekubukeziwe.

source: A new online standard to recognize and verify learning
zu: Indlela entsha yaku-inthanethi yokubona nokuqinisekisa ukufunda

source: A new window will open. Click on a button called <em>Copy text to clipboard</em>.
zu: Iwindi elisha lizovuleka. Chofoza inkinobho ebizwa ngokuthi <em>Kopisha umbhalo ku-clipboard</em>.

source: Answered
zu: Kuphenduliwe

source: answered by <a href="{user_url}">{username}</a> {when}
zu: kuphendulwe ngu <a href="{user_url}">{username}</a> {when}

source: {answerer} commented on a Firefox question on {host}:
zu: {answerer} uphawule ngombuzo we-Firefox {host}:

source: {answerer} has posted an answer to your question on {host}:
zu: {answerer} uphoste impendulo embuzweni wakho e{host}:

source: {answerer} wrote:
zu: {answerer} ubhale wathi:

source: Answer questions in the forum
zu: Phendula imibuzo esithangamini

source: Answer questions in the support forum
zu: Phendula imibuzo esithangamini sokweseka

source: Answers didn't help
zu: Izimpendulo azisizanga

source: Answer to Twitter users that need help. It's super easy with our canned responses.
zu: Phendula abasebenzisi be-Twitter abadinga usizo. Kulula kakhulu ngezimpendulo zethu esezihleliwe.

source: Answer Votes: % Helpful
zu: Impendulo Yamavoti: % Ewusizo

source: Application
zu: Isisebenziso

source: Application Issues
zu: Izinkinga Zama-application

source: Applications
zu: Ama-applications

source: Approved
zu: Kugunyaziwe

source: Approved {default_locale} version:
zu: Iveshini {default_locale} egunyaziwe:

source: Approve Revision
zu: Gunyaza Isibukezo

source: Approve Translation
zu: Gunyaza Isihumusho

source: Archived
zu: Okugcinwe kunqolobane

source: Archive this question
zu: Gcina lo mbuzo enqolobaneni

source: A request was received to reset the password for this account on %(sitename)s. To change this password please click on the following link, or paste it into your browser's location bar:
zu: Sithole isicelo sokusetha kabusha iphasiwedi yale akhawunti ku%(sitename)s. Ukuze kushintshwe le phasiwedi uyacelwa uchofoze ilinki elandelayo, noma uyinamathisele esikhaleni sesiphequluli sakho:

source: A revision must be based on the English article. Revision ID %(id)s does not fit this criterion.
zu: Ukubukezwa kufanele kuncike ku-athikhili yesiNgisi. Ukubukezwa kwe-ID %(id)s akungeni kulolu hlaka.

source: A revision you contributed to has been approved. %(reviewer)s has approved a revision to the document %(document_title)s.
zu: Isibukezo osilethile sigunyaziwe. %(reviewer)s bagunyaze isibukezo sedokhumenti %(document_title)s.

source: A revision you contributed to has been approved: {title}
zu: Ukubukeza obe negalelo kukhona kugunyaziwe: {title}

source: A revision you contributed to has been reviewed. %(reviewer)s has reviewed a revision to the document %(document_title)s.
zu: Isibukezo osilethile sibukeziwe. %(reviewer)s babukeze isibukezo sale dokhumenti %(document_title)s.

source: A revision you contributed to has been reviewed: {title}
zu: Ukubukeza obe negalelo kukhona kubukeziwe: {title}

source: Are you registered with Mozilla Support?
zu: Ingabe ubhalisile ku-Mozilla Support?

source: Are you sure
zu: Uqinisekile

source: Are you sure you want to delete the {group} group avatar?
zu: Unesiqiniseko sokuthi ufuna ukudilitha {group} i-avatar yeqembu?

source: Are you sure you want to delete these messages?
zu: Unesiqiniseko sokuthi ufuna ukudilitha le miyalezo?

source: Are you sure you want to delete this answer?
zu: Unesiqiniseko sokuthi ufuna ukudilitha le mpendulo?

source: Are you sure you want to delete this document?
zu: Unesiqiniseko sokuthi ufuna ukudilitha le dokhumenti?

source: Are you sure you want to delete this image?
zu: Unesiqiniseko sokuthi ufuna ukudilitha lo mfanekiso?

source: Are you sure you want to delete this message?
zu: Unesiqiniseko sokuthi ufuna ukudilitha lo myalezo?

source: Are you sure you want to delete this post?
zu: Unesiqiniseko sokuthi ufuna ukudilitha le phosti?

source: Are you sure you want to delete this question?
zu: Unesiqiniseko sokuthi ufuna ukudilitha lo mbuzo?

source: Are you sure you want to delete this revision?
zu: Unesiqiniseko sokuthi ufuna ukudilitha lesi sibukezo?

source: Are you sure you want to delete this thread?
zu: Unesiqiniseko sokuthi ufuna ukudilitha lolu chungechunge?

source: Are you sure you want to delete this video?
zu: Unesiqinisekiso sokuthi ufuna ukudilitha le vidiyo?

source: Are you sure you want to delete your avatar?
zu: Unesiqiniseko sokuthi ufuna ukudilitha i-avatar yakho?

source: Are you sure you want to remove {user}?
zu: Unesiqiniseko sokuthi ufuna ukukhipha {user}?

source: Are you sure you want to remove {user} from {group}?
zu: Unesiqiniseko sokuthi ufuna ukukhipha {user} e{group}?

source: Are you sure you want to remove {user} from {group} leaders?
zu: Unesiqiniseko sokuthi ufuna ukukhipha {user} e{group} labaholi?

source: Are you sure you want to remove {user} from the document contributors?
zu: Unesiqiniseko sokuthi ufuna ukukhipha {user} kwabanegalelo kudokhumenti?

source: Are you sure you want to unsubscribe?
zu: Unesiqiniseko sokuthi ufuna ukuzisusa ohlwini lwababhalisele ukuthola imininingwane?

source: Army of Awesome
zu: Ithimba Labahamba phambili

source: Army Of Awesome
zu: Ithimba Labaphambili

source: Army of Awesome: help users on Twitter
zu: Ithimba Labaphambili lisiza abasebenzisi ku-Twitter

source: Army of Awesome will never tweet without your permission.
zu: Ithimba Labaphambili alisoze lathumela ama-tweet ngaphandle kwemvume yakho.

source: Article
zu: I-athikhili

source: Article contains
zu: I-athikhili iqukethe

source: Article Discussions
zu: Izingxoxo zama-athikhili

source: Article is for:
zu: I-athikhili:

source: Article Revisions
zu: Izibukezo ze-athikhili

source: Articles
zu: Ama-athikhili

source: Articles that require changes.
zu: Ama-athikhili adinga izinguquko.

source: Articles that tell you how you can do more with Thunderbird
zu: Ama-athikhili akutshela ukuthi ungenza kanjani okuningi nge-Thunderbird

source: Articles which have approved revisions newer than the latest ready-for-localization one
zu: Ama-athikhili anezibukezo ezigunyaziwe zakamuva kunalezo esezilungele ukwenziwa njengezasendaweni

source: Article URL
zu: I-athikhili ye-URL

source: Article Votes: % Helpful
zu: Amavoti ama-article : % Awusizo

source: Ask a New Question
zu: Buza Umbuzo Omusha

source: Ask a question
zu: Buza umbuzo

source: Ask a Question
zu: Buza Umbuzo

source: Ask A Question
zu: Buza Umbuzo

source: Ask a Question about Marketplace
zu: Buza Umbuzo mayelana ne-Marketplace

source: asked by <a href="{user_url}">{username}</a> {when}
zu: kubuzwe ngu <a href="{user_url}">{username}</a> {when}

source: Ask other contributors
zu: Buza abanye abanegalelo

source: Ask this
zu: Buza lokhu

source: Ask your question to our community of users
zu: Buza umbuzo wakho kubasebenzisi bomphakathi wethu

source: A small box will open. Click on an item called <em>Troubleshooting Information</em>.
zu: Ibhokisi elincane lizovuleka. Chofoza into ebizwa ngokuthi <em>Imininingwane ye-Troubleshooting </em>.

source: A small box will open. Click on the item called <em>Paste</em>. Alternatively, type <em>Ctrl+V</em> or <em>Command+V</em>.
zu: Ibhokisi elincane lizovuleka. Chofoza into ebizwa ngokuthi <em>Namathisela</em>. Kungenjalo, bhala ukuthi<em>Ctrl</em> noma <em>Command+V</em>.

source: A support account lets us alert you when people respond to your question.
zu: I-akhawunti yokweseka isivumela ukuba sikuqwashise lapho abantu bephendula umbuzo wakho.

source: As you get started answering questions that look easy you might run into a few questions. Like, what happens when an angry user does not want a work around or what happens next? The Contributor Quality Training may have these answered. It is possible to get started here:
zu: Ngenkathi uqala ukuphendula imibuzo ebukeka ilula ungahlangabezana nemibuzo embalwa. Njengokuthi, kwenzekani uma umsebenzisi othukuthele engafuni umsebenzi mayelana noma kwenzekani okulandelayo? Ukuqeqeshwa Kwabanegalelo Kwekhwalithi kungenzeka ukuthi kuphendule le mibuzo. Ungakwazi ukuqala lapha:

source: As you get started answering questions that look easy you might run into a few questions. Like, what happens when an angry user does not want a work around or what happens next? The Contributor Quality Training may have these answered. It is possible to get started here: <a href="%(url)s">Contributor Quality Training</a>.
zu: Njengoba uqala ukuphendula imibuzo ebukeka ilula ungahlangana nemibuzo embalwa. Njengokuthi, kwenzekani uma umsebenzisi othukuthele engafuni ukusebenza endaweni noma yini elandelayo eyenzekayo? Ukuqeqeshwa Kwekhwalithi Kwabanegalelo kungenzeka ukuthi iyiphendulile. Kungenzeka ukwazi ukuqala lapha: <a href="%(url)s">Ukuqeqeshwa Kwekhwalithi Kwabanegalelo</a>.

source: At least one number and one English letter are required in the password.
zu: Okungenani inombolo eyodwa nohlamvu lwegama olulowa lwesiNgisi kuyadingeka kuphasiwedi.

source: Attached screenshots
zu: Ama-screenshot ananyekiwe

source: Attention needed
zu: Kudinga ukunakwa

source: Attention Needed
zu: Kudinga Ukubhekisiswa

source: A user with that email address already exists.
zu: Umsebenzisi onalelo kheli le-imeyli usekhona vele.

source: Author
zu: Umbhali

source: %(author)s has posted a new thread in a forum you're watching. Here is the thread:
zu: %(author)s baphoste uchungechunge olusha esithangamini osibukele. Nalu lolo chungechunge:

source: %(author)s has replied to a thread you're watching. Here is their reply:
zu: %(author)s baphendule uchungechunge olubukele. Nansi impendulo yabo:

source: Automatically add
zu: Faka ngokuzenzakalela

source: Avatar
zu: I-avatar

source: Avatar:
zu: I-Avatar:

source: Award details
zu: Imininingwane yokuhlonyuliswa

source: Awarded badge: %(badge_name)s
zu: Ibheji elihlonyulisiwe: %(badge_name)s

source: Awarded by:
zu: Ihlonyuliswe ngu:

source: awarded to
zu: ahlonyuliswe ko

source: Awarded to:
zu: Kuhlonyuliswe ku:

source: Awarded to support contributors who contributed (KB article documentation, answering Forum Questions, localizing KB article documentation, tweets, etc) to the launch of Firefox 29, thanks! Firefox 29 features: 1. Firefox Desktop: Australis new look and feel AND Firefox Accounts based sync 2. Firefox for Android: Firefox Accounts based sync MOAR: https://sumo.etherpad.mozilla.org/sumo-australis-badges
zu: Kuhlonyuliswe ukuze kwesekwe abanegalelo ababambe iqhaza (ekubhalweni kwe-athikhili ye-KB, ukuphendulwa Kwemibuzo Yesithangami, ukuhunyushwa okwenziwe ku-athikhili ye-KB, ama-tweets, njll) lapho kwethulwa i-Firefox 29, siyabonga! Amafisha e-Firefox 29: 1. Ukubukeka nokusebenza okusha kwe-Firefox Desktop: Australis KANYE nokuqondaniswa okuncike kuma-akhawunti e-Firefox 2. I-Firefox for Android: okuqondaniswa okuncike kuma-akhawunti e-Firefox MOAR: https://sumo.etherpad.mozilla.org/sumo-australis-badges

source: %(awarder)s has awarded you the %(title)s badge!
zu: %(awarder)s abahlomulisi bakuhlomulise ngamabheji %(title)s!

source: A window will open in the top corner. Click Allow, and then click Install. If the automated way doesn't work, <a class="expander" href="%(url)s">try these manual steps</a>.
zu: Iwindi lizovuleka ekhoneni eliphezulu. Chofoza ukuthi Vumela, bese uchofoza ukuthi Fakela. Uma indlela ehlelwe ngaphambilini ingasebenzi, <a class="expander" href="%(url)s">zama lezi zitephu ezimanuwali</a>.

source: Back to:
zu: Emuva ku:

source: Back to History
zu: Emuva Emlandweni

source: Badge awarded to those who have contributed to the Kitsune code base.
zu: Ibheji elihlonyuliswa kulabo ababe negalelo enqolobaneni ye-Kitsune code.

source: Badge: %(badge_name)s
zu: Ibheji: %(badge_name)s

source: BadgeKit
zu: I-BadgeKit

source: Badges
zu: Amabheji

source: Ban
zu: Vimbela

source: Banned Users
zu: Abasebenzisi abavinjelwe

source: Ban User
zu: Umsebenzisi Ovinjelwe

source: Ban user will prevent a given twitter handle from using the Army of Awesome tool.
zu: Umsebenzisi ovimbelayo uzovimbela isibambo se-twitter esihlinzekiwe ukuba sisebenzise ithuluzi leThimba Labaphambili.

source: Basic browsing
zu: Ukuphequlula okuyisisekelo

source: Basic Features
zu: Amafisha Ayisisekelo

source: Basics to get started with Firefox for Windows 8 Touch.
zu: Ulwazi oluyisisekelo lokuthi uqala kanjani ku-Firefox Windows 8 Touch.

source: Be descriptive. Saying &quot;Playing video on YouTube is always choppy&quot; will help our volunteers identify your problem better than saying &quot;Something is wrong&quot; or &quot;Firefox is broken&quot;.
zu: Chazisisa kakhulu. Uthi &quot;Ukudlala ividiyo ku-YouTube kuhlezi kunqamuka&quot; kuzosiza amavolontiya ethu aqagule inkinga yakho kangcono kunokuthi uthi &quot;Kukhona okungahambi kahle&quot; noma &quot;I-Firefox ayisebenzi&quot;.

source: Before
zu: Ngaphambi

source: Before we update your email, you must confirm it. Please click the link below or copy and paste the whole thing into your browser's location bar:
zu: Ngaphambi kokuba sivuselele i-imeyli yakho, kufanele uyiqinisekise. Uyacelwa uchofoze ilinki engezansi noma ukoipishele yonke le nto esikhaleni sakhona sokuphequlula:

source: Before you can log in, you need to confirm your email address. We've sent a new confirmation email to any account using <strong>%(email)s</strong>. To confirm the email address, just follow the link in the email.
zu: Ngaphambi kokuba ulogele ukungena, udinga ukuqinisekisa ikheli le-imeyli yakho. Sithumelele i-imeyli entsha yokuqinisekisa kunoma iyiphi i-akhawunti ye-imeyli sisebenzisa i <strong>%(email)s</strong>. Ukuqinisekisa ikheli le-imeyli, vele ulandele ilinki ekuleyo imeyli.
